Classes | Public Member Functions | Friends | List of all members
ACAPI::MEP::CableCarrierPortDefault Class Referencefinal
MEP Element Manager
Through this CableCarrierPortDefault you can access and configure the CableCarrierPorts of MEPElementDefaults before placement. More...
#include <MEPCableCarrierPortDefault.hpp>
 Inheritance diagram for ACAPI::MEP::CableCarrierPortDefault:
 Classes
class  | Modifier
Modifier of the CableCarrierPortDefault. More...
 Public Member Functions
double  | GetHeight () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::MEP::PortDefaultBase
GS::UniString  | GetName () const
double  | GetWidth () const
ConnectorShape  | GetShape () const
API_AttributeIndex  | GetMEPSystem () const
Domain  | GetDomain () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | ACAPI::Impl::ObjectCreator
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::PortDefaultBase
PortDefaultBase (std::shared_ptr< Impl::IPortDefaultBaseImpl > impl)
Constructs a PortBase with the given PortDefaultBase implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Through this CableCarrierPortDefault you can access and configure the CableCarrierPorts of MEPElementDefaults before placement.
Since
Archicad 28
Example code snippet from Test / New MEP
Take a look at PortDefaultBase
Member Function Documentation
◆ GetHeight()
 double ACAPI::MEP::CableCarrierPortDefault::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the CableCarrierPort.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::CableCarrierPortDefault::Modify  |  ( |  ModifierFunc && |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.